# Aggregating Data

In [1]:
import pandas as pd

In [11]:
coffee = pd.read_csv('coffee.csv')
bios = pd.read_csv('bios.csv')

In [6]:
coffee.head()
bios[bios['born_country'] == 'USA']['born_region'].value_counts().tail(25)

born_region
Utah              91
Missouri          91
North Carolina    86
Arizona           83
New Hampshire     83
Vermont           68
Mississippi       66
Alabama           64
Kentucky          62
Tennessee         62
Nebraska          60
Rhode Island      56
Montana           55
Maine             50
South Carolina    50
Alaska            45
Arkansas          42
Idaho             41
New Mexico        38
Nevada            36
South Dakota      27
West Virginia     24
Delaware          22
North Dakota      16
Wyoming           14
Name: count, dtype: int64

In [ ]:
coffee.groupby(['Coffee Type'])['Units Sold'].sum() # sum of units sold by coffee type
coffee.groupby(['Coffee Type']).agg({'Units Sold': 'sum'}) # sum of units sold by coffee type but different notation

             Units Sold
Coffee Type
Espresso            130
Latte                90

In [16]:
pivot = coffee.pivot(columns='Coffee Type', index='Day', values='Units Sold')
pivot

Coffee Type  Espresso  Latte
Day
Monday             25     15
Thursday           40     30
Tuesday            30     20
Wednesday          35     25

In [ ]:
pivot.sum(axis=1) # sum of rows

Day
Monday       40
Thursday     70
Tuesday      50
Wednesday    60
dtype: int64

In [19]:
bios['born_date'] = pd.to_datetime(bios['born_date'])

bios.groupby(bios['born_date'].dt.year)['name'].count().reset_index().sort_values('name', ascending=True)

     born_date  name
0       1828.0     1
2       1833.0     1
3       1836.0     1
4       1837.0     1
6       1839.0     1
..         ...   ...
137     1970.0  2174
138     1971.0  2205
140     1973.0  2216
152     1985.0  2227
139     1972.0  2231

[177 rows x 2 columns]